WINDOW_SIZE = (640, 480) # размер окна
WIDTH = 640 # ширина
HEIGHT = 480 # высота
DISPLAY_SIZE = (320, 240) # размер области относительно которой движется камера

TILE_SIZE = 32

MOVING_SPEED = 3.5 # скорость движения

SLOW_SPEED = [0.03, 0.06, 0.09, 0.12, 0.15, 0.18]  # замедление
NORMAL_SPEED = [0.05, 0.1, 0.15, 0.2, 0.25, 0.3] # нормальная скорость
FAST_SPEED = [0.1, 0.2, 0.3, 0.4, 0.5, 0.6] # ускорение

FPS = 60 # фпс

# цвета
SKY = (80, 200, 255)
BLACK = (0, 0, 0)
RED = (0, 0, 255)
WHITE = (200, 200, 200)
BEIGE = (244, 243, 143)
